package sensebot;

import org.telegram.telegrambots.bots.TelegramLongPollingBot;
import org.telegram.telegrambots.meta.api.methods.send.SendMessage;
import org.telegram.telegrambots.meta.api.objects.Update;
import org.telegram.telegrambots.meta.exceptions.TelegramApiException;


public class SenseBot extends TelegramLongPollingBot {


    @Override
    public String getBotUsername() {
        return "sensedancebot";
    }

    @Override
    public String getBotToken() {
        return "5457111971:AAF57F8LTZyIQUFdDdEUqkKOeUo6uPkC1YM";
    }

    @Override
    public void onUpdateReceived(Update update) {

        SendMessage message = new SendMessage();
        message.setChatId(update.getMessage().getChatId().toString());

        boolean i = true;

        if (update.getMessage().getText().equals("/1")){
            message.setText("ПОНЕДЕЛЬНИК\n" +
                    "\n" +
                    "Бачата леди(начинающие) Альбина - 10.00\n" +
                    "Бачата леди(средние) Евгения - 11.00\n" +
                    "Стретчинг (все уровни) Марсель - 12.05\n" +
                    "\n" +
                    "Бачата (средние) Айрат и Валерия - 18.30 \n" +
                    "Стретчинг(все уровни) Марсель\n" +
                    "\n" +
                    "Сальса NY(старшие) Тимур - 19.30 \n" +
                    "Бачата леди(продолжающие) Евгения \n" +
                    "\n" +
                    "Футворк в бачате(все уровни) Валерия - 20.30 \n" +
                    "Сальса NY(начинающие) Тимур \n" +
                    "Бачата (начинающие) Ильдар и Кристина \n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "ВТОРНИК\n" +
                    "\n" +
                    "Восток(все уровни) Миляуша - 18.30\n" +
                    "Бачата(продвинутые) Габриэль и Евгения \n" +
                    "\n" +
                    "Танго Регина - 19.30 \n" +
                    "Бачата леди(средние) Валерия \n" +
                    "\n" +
                    "Бачата(средние) Габриэль и Евгения - 20.30\n" +
                    "Кизомба Оскар и Аделя  \n" +
                    "Бачата леди(средние) Валерия \n" +
                    "\n" +
                    "Бачата(средние) Габриэль и Евгения - 21.30\n" +
                    "Кизомба Оскар и Аделя \n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "СРЕДА\n" +
                    "\n" +
                    "Бачата леди(начинающие) Альбина - 10.00\n" +
                    "\n" +
                    "Бачата леди(средние) Евгения - 11.00\n" +
                    "\n" +
                    "Стретчинг(все уровни Марсель - 12.05\n" +
                    "\n" +
                    "Бачата(средние) Айрат и Валерия  - 18.30 \n" +
                    "Стретчинг(все уровни) Марсель \n" +
                    "\n" +
                    "Сальса NY(старшие) Тимур - 19.30\n" +
                    "Бачата леди(продолжающие) Евгения\n" +
                    " \n" +
                    "Сальса NY(начинающие) Тимур - 20.30\n" +
                    "Бачата(начинающие) Ильдар и Кристина \n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "ЧЕТВЕРГ\n" +
                    "\n" +
                    "Бачата(продвинутые) Габриель и Евгения - 18.30\n" +
                    "Стретчинг(все уровни) Марсель \n" +
                    "\n" +
                    "Танго(Регина) - 19.30\n" +
                    "\n" +
                    "Бачата(средние) Айрат и Валерия - 20.40\n" +
                    "\n" +
                    "Бачата(средние) Айрат и Валерия - 21.40 \n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "ПЯТНИЦА\n" +
                    "\n" +
                    "Восток(все уровни) Миляуша - 18.30\n" +
                    "\n" +
                    "Бачата леди(начинающие) - 19.30 \n" +
                    "\n" +
                    "Бачата леди(средние) Валерия - 20.30\n" +
                    "\n" +
                    "ВЕЧЕРИНКА - 22.00\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "СУББОТА \n" +
                    "\n" +
                    "Сальса леди(средние) Кристина - 13.00\n" +
                    "\n" +
                    "Сальса(средние) Тимур - 14.00\n" +
                    "Бачата(начинающие) Руслан и Эльмира\n" +
                    "\n" +
                    "Сальса(средние) Тимур - 15.00\n" +
                    "Бачата(начинающие) Руслан и Эльмира\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "ВОСКРЕСЕНЬЕ\n" +
                    "\n" +
                    "Стретчинг (все уровни) Марсель - 16.00");
            i = false;
        }
        if (update.getMessage().getText().equals("/2")) {
            message.setText("РАЗОВЫЕ ЗАНЯТИЯ"+ "\n" +
                    "Пробное первое занятие - 300 руб " + "\n" +
                    "Разовое занятие - 700 руб" + "\n" +
                    "  " +"\n" +
                    "АБОНЕМЕНТЫ" + "\n" +
                    "Абонемент на 5 занятий, 30 дней- 3000 руб " + "\n" +
                    "Абонемент на 10 занятий, 40 дней- 4500 руб" + "\n" +
                    "Абонемент на 25 занятий, 95 дней- 10000 руб " + "\n" +
                    "Абонемент на 50 занятий, 185 дней- 18000 руб " + "\n" +
                    "Абонемент на 100 занятий, 365 дней- 33000 руб " + "\n" +
                    "  "+ "\n" +
                    "БЕЗЛИМИТЫ" +"\n" +
                    "Безлимитный абонемент 1, 1 месяц - 8000 руб  " + "\n" +
                    "Безлимитный абонемент 3, 3 месяца - 22000 руб " + "\n" +
                    "Безлимитный абонемент 6, 6 месяцев - 38000 руб " + "\n" +
                    "Безлимитный абонемент 12, 12 месяцев - 70000 руб " + "\n" +
                    "  "+ "\n" +
                    "ИНДИВИДУАЛЬНЫЕ ЗАНЯТИЯ" + "\n" +
                    "Индивидуальное занятие 1 - 1700 руб(1 занятие) 7500 руб(5 занятий)" + "\n" +
                    "Индивидуальное занятие 2 - 2000 руб(1 занятие) 8500 руб(5 занятий)" + "\n" +
                    "Индивидуальное занятие 3 - 2500 руб(1 занятие) 10000 руб (5 занятий)");
            i = false;
        }
        if (i){
            message.setText("Неправильная команда");
        }
        try {
            execute(message);
        } catch (TelegramApiException e) {
            e.printStackTrace();
        }


    }

    /*5457111971:AAF57F8LTZyIQUFdDdEUqkKOeUo6uPkC1YM*/
}
